In [38]:
import pandas as pd
import numpy as np
import scipy

In [2]:
df = pd.read_excel('../data/ev_station.xlsx')

In [3]:
df.head()

,area,city,2017-01-01 00:00:00,2017-02-01 00:00:00,2017-03-01 00:00:00,2017-04-01 00:00:00,2017-05-01 00:00:00,2017-06-01 00:00:00,2017-07-01 00:00:00,2017-08-01 00:00:00,2017-09-01 00:00:00
0,bejing,chaoyang,2,23,44,35,26,55,65,76,55
1,guizhou,guiyang,12,23,34,35,46,57,65,45,36

In [9]:
df.stack()

0  area                     bejing
   city                   chaoyang
   2017-01-01 00:00:00           2
   2017-02-01 00:00:00          23
   2017-03-01 00:00:00          44
   2017-04-01 00:00:00          35
   2017-05-01 00:00:00          26
   2017-06-01 00:00:00          55
   2017-07-01 00:00:00          65
   2017-08-01 00:00:00          76
   2017-09-01 00:00:00          55
1  area                    guizhou
   city                    guiyang
   2017-01-01 00:00:00          12
   2017-02-01 00:00:00          23
   2017-03-01 00:00:00          34
   2017-04-01 00:00:00          35
   2017-05-01 00:00:00          46
   2017-06-01 00:00:00          57
   2017-07-01 00:00:00          65
   2017-08-01 00:00:00          45
   2017-09-01 00:00:00          36
dtype: object

In [11]:
df.columns.values

array(['area', 'city', datetime.datetime(2017, 1, 1, 0, 0),
       datetime.datetime(2017, 2, 1, 0, 0),
       datetime.datetime(2017, 3, 1, 0, 0),
       datetime.datetime(2017, 4, 1, 0, 0),
       datetime.datetime(2017, 5, 1, 0, 0),
       datetime.datetime(2017, 6, 1, 0, 0),
       datetime.datetime(2017, 7, 1, 0, 0),
       datetime.datetime(2017, 8, 1, 0, 0),
       datetime.datetime(2017, 9, 1, 0, 0)], dtype=object)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 11 columns):
area                   2 non-null object
city                   2 non-null object
2017-01-01 00:00:00    2 non-null int64
2017-02-01 00:00:00    2 non-null int64
2017-03-01 00:00:00    2 non-null int64
2017-04-01 00:00:00    2 non-null int64
2017-05-01 00:00:00    2 non-null int64
2017-06-01 00:00:00    2 non-null int64
2017-07-01 00:00:00    2 non-null int64
2017-08-01 00:00:00    2 non-null int64
2017-09-01 00:00:00    2 non-null int64
dtypes: int64(9), object(2)
memory usage: 304.0+ bytes

In [23]:
df.columns

Index([             'area',              'city', 2017-01-01 00:00:00,
       2017-02-01 00:00:00, 2017-03-01 00:00:00, 2017-04-01 00:00:00,
       2017-05-01 00:00:00, 2017-06-01 00:00:00, 2017-07-01 00:00:00,
       2017-08-01 00:00:00, 2017-09-01 00:00:00],
      dtype='object')

In [28]:
cols = df.columns
cols_fnl = cols.drop(['area','city'])

In [37]:
cols_fnl

Index([2017-01-01 00:00:00, 2017-02-01 00:00:00, 2017-03-01 00:00:00,
       2017-04-01 00:00:00, 2017-05-01 00:00:00, 2017-06-01 00:00:00,
       2017-07-01 00:00:00, 2017-08-01 00:00:00, 2017-09-01 00:00:00],
      dtype='object')

In [ ]:
    id_vars=None,
    value_vars=None,
    var_name=None,
    value_name='value',
    col_level=None,

In [57]:
# df.pivot(columns='area',index='city',values='2017-01-01 00:00:00')
df.melt()

variable  0                    area
          1                    area
          2                    city
          3                    city
          4     2017-01-01 00:00:00
          5     2017-01-01 00:00:00
          6     2017-02-01 00:00:00
          7     2017-02-01 00:00:00
          8     2017-03-01 00:00:00
          9     2017-03-01 00:00:00
          10    2017-04-01 00:00:00
          11    2017-04-01 00:00:00
          12    2017-05-01 00:00:00
          13    2017-05-01 00:00:00
          14    2017-06-01 00:00:00
          15    2017-06-01 00:00:00
          16    2017-07-01 00:00:00
          17    2017-07-01 00:00:00
          18    2017-08-01 00:00:00
          19    2017-08-01 00:00:00
          20    2017-09-01 00:00:00
          21    2017-09-01 00:00:00
value     0                  bejing
          1                 guizhou
          2                chaoyang
          3                 guiyang
          4                       2
          5                      12
          6                      23
          7                      23
          8                      44
          9                      34
          10                     35
          11                     35
          12                     26
          13                     46
          14                     55
          15                     57
          16                     65
          17                     65
          18                     76
          19                     45
          20                     55
          21                     36
dtype: object

In [60]:
df.transpose()

                            0        1
area                   bejing  guizhou
city                 chaoyang  guiyang
2017-01-01 00:00:00         2       12
2017-02-01 00:00:00        23       23
2017-03-01 00:00:00        44       34
2017-04-01 00:00:00        35       35
2017-05-01 00:00:00        26       46
2017-06-01 00:00:00        55       57
2017-07-01 00:00:00        65       65
2017-08-01 00:00:00        76       45
2017-09-01 00:00:00        55       36

In [65]:
df2 =pd.melt(df, id_vars=['area','city'], value_vars=cols_fnl)

In [69]:
df2.head()

      area      city   variable  value
0   bejing  chaoyang 2017-01-01      2
1  guizhou   guiyang 2017-01-01     12
2   bejing  chaoyang 2017-02-01     23
3  guizhou   guiyang 2017-02-01     23
4   bejing  chaoyang 2017-03-01     44

In [70]:
df2.columns=['area','city','pdate','cnt']

In [71]:
df2.head()

      area      city      pdate  cnt
0   bejing  chaoyang 2017-01-01    2
1  guizhou   guiyang 2017-01-01   12
2   bejing  chaoyang 2017-02-01   23
3  guizhou   guiyang 2017-02-01   23
4   bejing  chaoyang 2017-03-01   44

In [72]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
area     18 non-null object
city     18 non-null object
pdate    18 non-null datetime64[ns]
cnt      18 non-null int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 704.0+ bytes

In [76]:
df2.set_index('pdate', inplace=True)

df2['month']=df2.index.month

df2['year']=df2.index.year

In [80]:
df2.head()

               area      city  cnt  month  year
pdate
2017-01-01   bejing  chaoyang    2      1  2017
2017-01-01  guizhou   guiyang   12      1  2017
2017-02-01   bejing  chaoyang   23      2  2017
2017-02-01  guizhou   guiyang   23      2  2017
2017-03-01   bejing  chaoyang   44      3  2017

In [82]:
df2.pivot_table(index=['year','month'],values='cnt')

             cnt
year month
2017 1       7.0
     2      23.0
     3      39.0
     4      35.0
     5      36.0
     6      56.0
     7      65.0
     8      60.5
     9      45.5